Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courtroom/junior_and_senior_counsel.html.txt.tmx
Source language: en
Languages: ga

source: Junior and senior counsel
ga: Abhcóidí sóisir agus sinsir

source: When barristers are first "called to the Bar", they act as junior counsel
ga: Nuair a ghlaoitear abhcóidí chun an Bharra feidhmíonn siad mar abhcóidí sóisir

source: A junior counsel may have the letters BL after his/her name, which stand for "Barrister at Law"
ga: Is féidir go mbeadh BL, a chiallaíonn "Barrister at Law", i ndiaidh a ainm/a hainm ag abhcóide sóisir

source: Junior counsel tend to do most of the paperwork in cases (drafting legal documents) and they represent clients mainly in the lower courts (the District Court and the Circuit Court)
ga: Déanann na habhcóidí an chuid is mó den pháipéarachas a dhéanamh i gcásanna (doiciméid dhlithiúla a dhréachtú ) agus feidhmíonn siad ar son cliant sna cúirteanna íochtaracha (an Chúirt Dúiche agus an Chúirt Chuarda)

source: After about 10 to 15 years of practising as a junior counsel, a barrister may decide to become a senior counsel
ga: Tar éis 10 go dtí 15 bliana a chaitheamh ag feidhmiú mar abhcóidí sóisir, d'fhéadfadh abhcóide a shocrú ar bheith ina abhcóide sinsir

source: This is sometimes called "taking silk" because the senior counsel's gown was traditionally made of silk
ga: Cuirtear "ag glacadh síoda" air seo uaireanta, óir go traidisiúnta bhí róba an abhcóide shinsir déanta as síoda

source: A senior counsel may have the letters SC after his/her name
ga: Is féidir go mbeadh SC in ndiaidh a ainm/a hainm ag abhcóide sinsir

source: Senior counsel are very experienced advocates who represent clients in the High Court and the Supreme Court
ga: Abhcóidí a bhfuil an-chuid taithí acu is ea iad abhcóidí sinsir, a fheidhmíonn ar son cliant san Ard Chúirt agus sa Chúirt Uachtarach

source: Usually, if a senior counsel is involved in a case, there will also be a junior counsel to assist
ga: Go hiondúil má tá abhcóide sinsir ag glacadh páirte i gcás, beidh abhcóide sóisir i láthair le cabhrú leis/léi
